DeviceEvents
| where ingestion_time() > ago(1d) //query below counts the number of unique devices (DeviceId) with antivirus detections and uses this count to find only the devices with more than two detections. 
| where ActionType == "AntivirusDetection"
| summarize (Timestamp, ReportId)=arg_max(Timestamp, ReportId), count() by DeviceId
| where count_ > 2
